/**
*@file  gimbalTask.h
*@date  2019/2/16
*@author Satori
*@brief 協吶匯和符似議岱鈍伊壯議叫廉
*/

#ifndef _SHOOT_H_
#define _SHOOT_H_

/*！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！哈喘！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/

#include "stm32f4xx_hal.h"

/*！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！潤更悶！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/

/*！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！崎協吶！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/

typedef enum
{
    SHOOT_AUTO                      = 0,
    SHOOT_REMOTE_CONTROL            = 1,
    SHOOT_KEYMOUSE_CONTROL          = 2,
    SHOOT_STOP                      = 3,
} shoot_mode;

/*！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！延楚！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/


/*！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！痕方！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！*/

#endif /*_SHOOT_H_*/
